orgCase/base_k-omegaSST/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         500;
deltaT          1.0;
adjustTimeStep  no;
maxCo           0.9;
writeControl    timeStep;
writeInterval   50;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;

functions
{
    
    forceCoeffs(sphereMeshed)
    {
        type forceCoeffs;
        libs ("libforces.so");
        writeControl timeStep;
        timeInterval 1;
        log no;
        patches (ball);
        rho rhoInf;
        rhoInf 1;
        liftDir (0 1 0);
        dragDir (1 0 0);
        CofR (-1.4502967656966168e-05 2.286241662386465e-06 -0.00013135530234728088);
        pitchAxis (0 0 1);
        magUInf 1.0;
        lRef 0.25;
        Aref 0.049093946015625;
    }

    writeCellCentres1
    {
        type            writeCellCentres;
        libs            (fieldFunctionObjects);
    
        enabled         true;
        writeControl    writeTime;
        writeInterval   1;
    }

    residuals
    {   
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        fields          (U p k epsilon);
    }
    //#includeFunc residuals(U,p,k,epsilon);
    #includeFunc yPlus;
    #includeFunc CourantNo;
  }