orgCase/base_k-omegaSST/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{
  Cuboid.stl
  {
    type triSurfaceMesh;
    name Cuboid;
    regions
    {
      XMax
      {
        name XMax;
      }
      XMin
      {
        name XMin;
      }
      YMax
      {
        name YMax;
      }
      YMin
      {
        name YMin;
      }
      ZMax
      {
        name ZMax;
      }
      ZMin
      {
        name ZMin;
      }
    }
  }
  sphereMeshed.stl
  {
    type triSurfaceMesh;
    name sphereMeshed;
    regions
    {
      sphereMeshed
      {
        name sphereMeshed;
      }
    }
  }
  box0
  {
    type searchableBox;
    // Error epsilon is added/subtracted for stability.
    min (-2.000000001 -0.500000001 -0.500000001);
    max (4.000000001 0.500000001 0.500000001);
  }
  box1
  {
    type searchableBox;
    // Error epsilon is added/subtracted for stability.
    min (-1.000000001 -0.250000001 -0.250000001);
    max (2.000000001 0.250000001 0.250000001);
  }
}
castellatedMeshControls
{
  features (
    {
      file "Cuboid.eMesh";
      level 1;
    }
    {
      file "sphereMeshed.eMesh";
      level 1;
    }
  );
  refinementSurfaces
  {
    Cuboid
    {
      level (0 0);
      regions
      {
        XMax
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
        XMin
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
        YMax
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        YMin
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        ZMax
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        ZMin
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    sphereMeshed
    {
      level (0 0);
      regions
      {
        sphereMeshed
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
  }
  refinementRegions
  {
    box0
    {
      mode inside;
      levels ((1 1));
    }
    box1
    {
      mode inside;
      levels ((2 2));
    }
  }
  locationInMesh (2.0 1.0 1.0);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 12;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces false;
}
snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;
}
addLayersControls
{
  layers
  {
  sphereMeshed
  {
    nSurfaceLayers 5;
  }
  }
  relativeSizes true;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1;
  featureAngle 60;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}
meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1.00E-13;
  minTetQuality -1e30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}
debug 0;
mergeTolerance 1e-5;
