orgCase/base_k-omegaSST/Allrun
#!/bin/sh
cd ${0%/*} || exit 1
. $WM_PROJECT_DIR/bin/tools/RunFunctions

decomposePar
mpirun -np 4 simpleFoam -parallel
reconstructPar

rm -rf ./processor*
